tests/cassettes/test_xcover/test_confirm_booking.yaml

interactions:
- request:
    body: '{"request": [{"policy_type": "event_ticket_protection", "policy_type_version":
      1, "policy_start_date": "2021-11-17T08:47:37Z", "event_datetime": "2021-11-27T08:08:54Z",
      "event_name": "Ariana Grande", "event_location": "The O2", "number_of_tickets":
      2, "tickets": [{"price": 100}], "resale_ticket": false, "event_country": "GB"}],
      "currency": "GBP", "customer_country": "GB", "customer_region": "London", "customer_language":
      "en"}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '430'
      Content-Type:
      - application/json
      User-Agent:
      - python-requests/2.26.0
      date:
      - Tue, 16 Nov 2021 16:47:21 GMT
    method: POST
    uri: https://staging.api.xcover.com/xcover/partners/LLODT/quotes/
  response:
    body:
      string: "{\"id\":\"8EB89-4A3H7-INS\",\"status\":\"RECEIVED\",\"currency\":\"GBP\",\"total_price\":2.03,\"total_price_formatted\":\"\xA32.03\",\"partner_transaction_id\":null,\"created_at\":\"2021-11-17T03:47:21.912207Z\",\"updated_at\":\"2021-11-17T03:47:21.912223Z\",\"pds_url\":\"https://staging.xcover.com/en/pds/8EB89-4A3H7-INS\",\"security_token\":\"MLUQv-8JVsb-Tpg7X-Q2cvb\",\"quotes\":{\"0\":{\"id\":\"b1453dce-8884-42dc-bf76-6e12cba3c664\",\"policy_start_date\":\"2021-11-17T08:47:37+00:00\",\"policy_end_date\":\"2021-11-27T08:08:54+00:00\",\"status\":\"RECEIVED\",\"price\":2.03,\"price_formatted\":\"\xA32.03\",\"policy\":{\"policy_type\":\"event_ticket_protection\",\"policy_type_group_name\":\"event\",\"policy_name\":\"Missed
        Event Cover (Generic)\",\"policy_code\":\"MECG0001\",\"policy_version\":\"5d24e2d1-a341-4b8b-9917-82878470a9c3\",\"category\":\"event_ticket_protection\",\"content\":{\"title\":\"Missed
        Event Cover for Ariana Grande\",\"header\":null,\"description\":\"90% of attendees
        add Missed Event Cover for generous protection when things go wrong or your
        plans change. For only  per ticket it covers you - and all ticket holders
        - if:\",\"optout_msg\":\"\",\"disclaimer\":\"<p>This insurance is arranged
        by Cover Genius Ltd which is authorised and regulated by the FCA (No.750711).
        Policies are underwritten by Markel International Insurance Company Limited
        which is authorised by the PRA and regulated by the FCA, (No.202570).</p>\"},\"underwriter\":{\"disclaimer\":\"This
        plan is arranged by XCover.com\",\"name\":\"Cover Genius Pty Ltd\"},\"claim_selector_id\":\"\"},\"insured\":null,\"tax\":{\"total_tax\":1.11,\"total_amount_without_tax\":0.92,\"total_tax_formatted\":\"\xA31.11\",\"total_amount_without_tax_formatted\":\"\xA30.92\",\"taxes\":[{\"tax_amount\":1.0,\"tax_code\":\"Admin.
        fee\",\"tax_amount_formatted\":\"\xA31.00\"},{\"tax_amount\":0.11,\"tax_code\":\"IPT\",\"tax_amount_formatted\":\"\xA30.11\"}]},\"duration\":\"9
        23:21:17\",\"benefits\":[{\"description\":\"Updated Transalation\",\"limit\":5.42,\"limit_policy_currency\":10.0,\"limit_formatted\":\"\xA35.42\",\"limit_policy_currency_formatted\":\"A$10.00\",\"excess\":2.71,\"excess_policy_currency\":5.0,\"excess_formatted\":\"\xA32.71\",\"excess_policy_currency_formatted\":\"A$5.00\"},{\"description\":\"Updated
        Transalation\",\"limit_description\":\"Benefit Text Test 01\",\"excess\":3.25,\"excess_policy_currency\":6.0,\"excess_formatted\":\"\xA33.25\",\"excess_policy_currency_formatted\":\"A$6.00\"},{\"description\":\"Description\",\"limit\":8.14,\"limit_policy_currency\":15.0,\"limit_formatted\":\"\xA38.14\",\"limit_policy_currency_formatted\":\"A$15.00\"},{\"description\":\"Description\",\"limit\":10.85,\"limit_policy_currency\":20.0,\"limit_formatted\":\"\xA310.85\",\"limit_policy_currency_formatted\":\"A$20.00\",\"excess_description\":\"Excess
        Text Test 01\"},{\"description\":\"Description\",\"limit_description\":\"Benefit
        Text Test 02\",\"excess_description\":\"Excess Text Test 02\"}],\"commission\":{\"partner_commission\":0.0,\"partner_commission_formatted\":\"\xA30.00\",\"surcharge_commission\":0.0,\"surcharge_commission_formatted\":\"\xA30.00\",\"total_commission\":0.0,\"total_commission_formatted\":\"\xA30.00\"},\"created_at\":\"2021-11-17T03:47:21.905118Z\",\"confirmed_at\":null,\"updated_at\":\"2021-11-17T03:47:21.905134Z\",\"cancelled_at\":null,\"is_renewable\":false,\"is_pricebeat_enabled\":null,\"cover_amount\":54.23,\"cover_amount_formatted\":\"\xA354.23\",\"pds_url\":\"https://staging.xcover.com/en/pds/8EB89-4A3H7-INS?policy_type=event_ticket_protection_v1\",\"attachments\":[],\"files\":[],\"extra_fields\":{},\"surcharge\":{\"total_amount\":null,\"total_amount_formatted\":null,\"surcharges\":null},\"discount_price\":2.03,\"discount_price_formatted\":\"\xA32.03\",\"discount_amount\":0.0,\"discount_amount_formatted\":\"\xA30.00\",\"instalment_plans\":[]}},\"bundle_code\":null,\"bundle_price\":2.03,\"bundle_content\":{},\"bundle_price_formatted\":\"\xA32.03\",\"bundle_discount_percent\":0.0,\"bundle_discount_amount\":0.0,\"bundle_discount_amount_formatted\":\"\xA30.00\",\"errors\":{}}"
    headers:
      Allow:
      - GET, POST, DELETE, OPTIONS
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 6af5fa2beeb32b0e-SYD
      Connection:
      - keep-alive
      Content-Length:
      - '3735'
      Content-Type:
      - application/json
      Date:
      - Wed, 17 Nov 2021 03:47:22 GMT
      Expect-CT:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Referrer-Policy:
      - same-origin
      Server:
      - cloudflare
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - DENY
      X-Ratelimit-Limit:
      - '-1'
      X-Ratelimit-Remaining:
      - '-1'
      X-Ratelimit-Reset:
      - '1568836675'
    status:
      code: 201
      message: Created
- request:
    body: '{"quotes": [{"id": "b1453dce-8884-42dc-bf76-6e12cba3c664"}], "policyholder":
      {"first_name": "Edgar", "last_name": "Perry", "age": 30, "email": "edgar.perry@test-xcover.com",
      "country": "GB", "region": null, "company": "Campbell-Guerrero"}, "require_payment_confirmation":
      true}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '277'
      Content-Type:
      - application/json
      User-Agent:
      - python-requests/2.26.0
      date:
      - Tue, 16 Nov 2021 16:47:21 GMT
    method: POST
    uri: https://staging.api.xcover.com/xcover/partners/LLODT/bookings/8EB89-4A3H7-INS/
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAA6RX/W7juBF/FYJoi1tUUiRZimTh9q7ZXC7dYjfIXnOHvS0WAk2Obd5KpEpSSdzA
        T9M36ZMdRh927MRZt/3HMOeD85vfkMPRA5WCFjS/eJNP/eRs8tfMf3v1d+pR65hrLS3o9cXVD2+v
        Lsvrs1/fX1zdUI/y1hhQfEULevnmmnrUaceqsjGSAy3iIJzsiMq5NjVzDjDQf/6NeurRhhmnwJTO
        MGUZd1KrEqGotqo8yg0wB6JkjhY0DuPIjyI/ym7CSZFkRRwF0yiOw+wT9WjbiJdM4yBJwyiJ0bQR
        tmxNRQu6dK6xxcmJdWwh1SK45/oWTMB1fQLqpBH25BlGgLdGulXp9BdQtKDv3/384dbP//aLnfk3
        zSL76H+I+e2MevSfrXZgafGPh57eWZSkE8HBz/M88ZNYcH82z079U4hiPmMTfnqaID5dSb4qrWPG
        lZjVXkY5ZjTJ/hyGRRhu7UGJfeu4sw7zIk021i9UdKd0LxWtC0iLhzG0WzUYFm5BudJJ/gVc2Rjt
        oCvoFiLalQuj26ZUrN64bA0G6XtpLQhygUpyjjUh31yCAiP5q60x16Izvji/DMMw2ipuwViMW9BU
        xAnEIvLZJIn8ZJbP/Ok0yvw8zrM8yUI25ZgQZw4W2qxezIFr5RBs8UCddNUBnHNtyJmRTDFyaZgS
        QD26BCbAjIdagOVGNq5HOA3/SPScIMdKAFjChCAH9l0gBbq1ZIuL3C1BEbeUamHJQpM7o9WCaENW
        ujWkqZiyhC+ZWkBAftSGaFWtCGnAkD5FIh3pDr1FD+ITpgRhVTWql7oSqPSJnBfUo7pxunVlbRe0
        oNSjQlpeMVljevTb5rubpbREKtsapjgQaQkzBsMLMlsNqVyCkq0l75wgd0vJl51V65baSMwaERhY
        tBXeZ/RySyA/np+Rb650kKVhFkWvAnKNpZbIlwHSKgHmzkgkET3eM/MFKvJWOTCKIU8MVyOqc103
        TK3IO1lLjPEciiHu9U9nBwF5HaI4jNMsfBV8e9J8R9ce3WBBSh52CerYwaLsE/PxfGw81KPDJdgh
        69qtkDAM0G1XWqiAO226bklR3rEOm97p2H13VLsO3C2iIIrGlsxq3SpX3km3xHp2+jCYxt7WYe/u
        ozc97L5njXvRDsTQANGk90IgYacab/CZqKUKyBygdxm33wcQhnTt7W4V9jlt93p7ffPSJmhP15/X
        HhWtYeMdJPGkiKMiyqhHZ6BgLl2Peveu/ty/MeSme6wqNjSGCo8RLdIgiYdFOXaozRMZhZhzr9xF
        hG70gN+O6dkfcBNs4XDPwVps1Fk0rp6GTDHioNxv41lEDznuxUxH1o+notw1fdMTSm7gHn+sI2H0
        KIlJEKeHkzg9mAT6HZvE6fNJ/PBotSljHkTJ4TKmh8qIbseWMf0v4ERhkKcH8cQHj1XndySgeOdc
        7ZXvohPuVu8o7F8/BvHxMWO6/oxPcF1L27/tD5vZ8bG04+Op4kkX6Eeh1vAlMwt4usVzquc36Rvi
        kw32xc85r4+ZcMM0ivJP/fwxl6YejPsm//WpNwmjPOrc8emrqh13aUsDCu7YDMeZOassdMJu9psB
        cyUo1G0HcnyTNs03TYJ4sivcb25o8f+N3N8/mh1fH5jOylvsKMw5xpc1qK55f/boXFYw/IV7Z1g5
        l1AJS4uH9aMKb1/JMa/hAX380j1Kq9du3G0vWXtUwb0b+Kw2hDFVzqDckD+w3B9miaGPoYVr+YSW
        3e+Q14e/Qhox/18CBI2YHxtk7VHGeUfUMekMtt9L8XoSh/M4BfBzlnA/gWnqsyyO/EmS8mSWsnwK
        0z9ZuVBtM2D4LeOfzv1PUZXf+3P4l1n4bz7efLjdTP/9xIrMzqWxbvykuBALZqhHaylEBYO0r1HF
        tmbXYMwK21LNJCYC6BY0KP2LA+v8bSYYcakVbO9Gq5zpP4fxNOLJmoQeZUIYsDYa7YZ1vPGTbjX+
        b7R1/SDTrw0supYynDngWglmVuUArxfPpHHL4dNvhNINuDhEsrqZQVX5ly0YA0YjsqrSd2XfOux4
        IL1Dk+JXJsHGQC3bend6HITPzYTr3wEAAP//AwBGGULXaxAAAA==
    headers:
      Allow:
      - GET, POST, PATCH, HEAD, OPTIONS
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 6af5fa2f7afafe70-SYD
      Connection:
      - keep-alive
      Content-Encoding:
      - gzip
      Content-Type:
      - application/json
      Date:
      - Wed, 17 Nov 2021 03:47:22 GMT
      Expect-CT:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Referrer-Policy:
      - same-origin
      Server:
      - cloudflare
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      Transfer-Encoding:
      - chunked
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - DENY
      X-Ratelimit-Limit:
      - '-1'
      X-Ratelimit-Remaining:
      - '-1'
      X-Ratelimit-Reset:
      - '1568836675'
    status:
      code: 200
      message: OK
- request:
    body: '{}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '2'
      Content-Type:
      - application/json
      User-Agent:
      - python-requests/2.26.0
      date:
      - Tue, 16 Nov 2021 16:47:22 GMT
    method: PUT
    uri: https://staging.api.xcover.com/xcover/partners/LLODT/bookings/8EB89-4A3H7-INS/confirm
  response:
    body:
      string: "{\"id\":\"8EB89-4A3H7-INS\",\"status\":\"CONFIRMED\",\"currency\":\"GBP\",\"total_price\":2.03,\"total_price_formatted\":\"\xA32.03\",\"partner_transaction_id\":null,\"created_at\":\"2021-11-17T03:47:21.912207Z\",\"updated_at\":\"2021-11-17T03:47:23.131820Z\",\"pds_url\":\"https://staging.xcover.com/en/pds/8EB89-4A3H7-INS\",\"security_token\":\"MLUQv-8JVsb-Tpg7X-Q2cvb\",\"quotes\":[{\"id\":\"b1453dce-8884-42dc-bf76-6e12cba3c664\",\"policy_start_date\":\"2021-11-17T08:47:37+00:00\",\"policy_end_date\":\"2021-11-27T08:08:54+00:00\",\"status\":\"CONFIRMED\",\"price\":2.03,\"price_formatted\":\"\xA32.03\",\"policy\":{\"policy_type\":\"event_ticket_protection\",\"policy_type_group_name\":\"event\",\"policy_name\":\"Missed
        Event Cover (Generic)\",\"policy_code\":\"MECG0001\",\"policy_version\":\"5d24e2d1-a341-4b8b-9917-82878470a9c3\",\"category\":\"event_ticket_protection\",\"content\":{\"title\":\"Missed
        Event Cover for Ariana Grande\",\"header\":null,\"description\":\"90% of attendees
        add Missed Event Cover for generous protection when things go wrong or your
        plans change. For only  per ticket it covers you - and all ticket holders
        - if:\",\"optout_msg\":\"\",\"disclaimer\":\"<p>This insurance is arranged
        by Cover Genius Ltd which is authorised and regulated by the FCA (No.750711).
        Policies are underwritten by Markel International Insurance Company Limited
        which is authorised by the PRA and regulated by the FCA, (No.202570).</p>\"},\"underwriter\":{\"disclaimer\":\"This
        plan is arranged by XCover.com\",\"name\":\"Cover Genius Pty Ltd\"},\"claim_selector_id\":\"\"},\"insured\":null,\"tax\":{\"total_tax\":1.11,\"total_amount_without_tax\":0.92,\"total_tax_formatted\":\"\xA31.11\",\"total_amount_without_tax_formatted\":\"\xA30.92\",\"taxes\":[{\"tax_amount\":1.0,\"tax_code\":\"Admin.
        fee\",\"tax_amount_formatted\":\"\xA31.00\"},{\"tax_amount\":0.11,\"tax_code\":\"IPT\",\"tax_amount_formatted\":\"\xA30.11\"}]},\"duration\":\"9
        23:21:17\",\"benefits\":[{\"description\":\"Updated Transalation\",\"limit\":5.42,\"limit_policy_currency\":10.0,\"limit_formatted\":\"\xA35.42\",\"limit_policy_currency_formatted\":\"A$10.00\",\"excess\":2.71,\"excess_policy_currency\":5.0,\"excess_formatted\":\"\xA32.71\",\"excess_policy_currency_formatted\":\"A$5.00\"},{\"description\":\"Updated
        Transalation\",\"limit_description\":\"Benefit Text Test 01\",\"excess\":3.25,\"excess_policy_currency\":6.0,\"excess_formatted\":\"\xA33.25\",\"excess_policy_currency_formatted\":\"A$6.00\"},{\"description\":\"Description\",\"limit\":8.14,\"limit_policy_currency\":15.0,\"limit_formatted\":\"\xA38.14\",\"limit_policy_currency_formatted\":\"A$15.00\"},{\"description\":\"Description\",\"limit\":10.85,\"limit_policy_currency\":20.0,\"limit_formatted\":\"\xA310.85\",\"limit_policy_currency_formatted\":\"A$20.00\",\"excess_description\":\"Excess
        Text Test 01\"},{\"description\":\"Description\",\"limit_description\":\"Benefit
        Text Test 02\",\"excess_description\":\"Excess Text Test 02\"}],\"commission\":{\"partner_commission\":0.0,\"partner_commission_formatted\":\"\xA30.00\",\"surcharge_commission\":0.0,\"surcharge_commission_formatted\":\"\xA30.00\",\"total_commission\":0.0,\"total_commission_formatted\":\"\xA30.00\"},\"created_at\":\"2021-11-17T03:47:21.905118Z\",\"confirmed_at\":\"2021-11-17T03:47:23.071327Z\",\"updated_at\":\"2021-11-17T03:47:23.119284Z\",\"cancelled_at\":null,\"is_renewable\":false,\"is_pricebeat_enabled\":null,\"cover_amount\":54.23,\"cover_amount_formatted\":\"\xA354.23\",\"pds_url\":\"https://staging.xcover.com/en/pds/8EB89-4A3H7-INS?policy_type=event_ticket_protection_v1\",\"attachments\":[],\"files\":[],\"extra_fields\":{},\"surcharge\":{\"total_amount\":null,\"total_amount_formatted\":null,\"surcharges\":null},\"next_renewal\":null,\"can_be_cancelled\":true}],\"coi\":{\"url\":\"https://staging.xcover.com/en/coi/8EB89-4A3H7-INS?security_token=MLUQv-8JVsb-Tpg7X-Q2cvb\",\"pdf\":\"https://staging.xcover.com/en/coi/8EB89-4A3H7-INS.pdf?security_token=MLUQv-8JVsb-Tpg7X-Q2cvb\"},\"account_url\":\"https://staging.xcover.com/en/account?id=320f25ee-8a4c-4e95-a721-345c4b5a89e9&signup_token=j7cZC-Z1l8x-fezrg-BXTQv\",\"policyholder\":{\"first_name\":\"Edgar\",\"middle_name\":null,\"last_name\":\"Perry\",\"email\":\"edgar.perry@test-xcover.com\",\"phone\":null,\"country\":\"GB\",\"age\":30,\"address1\":null,\"address2\":null,\"city\":null,\"postcode\":null,\"region\":null,\"secondary_email\":null,\"birth_date\":null,\"company\":\"Campbell-Guerrero\",\"allow_updates\":false},\"total_tax\":1.11,\"total_tax_formatted\":\"\xA31.11\",\"total_premium\":0.92,\"total_premium_formatted\":\"\xA30.92\"}"
    headers:
      Allow:
      - PUT, OPTIONS
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 6af5fa339ecc6a6c-SYD
      Connection:
      - keep-alive
      Content-Length:
      - '4215'
      Content-Type:
      - application/json
      Date:
      - Wed, 17 Nov 2021 03:47:23 GMT
      Expect-CT:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Referrer-Policy:
      - same-origin
      Server:
      - cloudflare
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - DENY
      X-Ratelimit-Limit:
      - '-1'
      X-Ratelimit-Remaining:
      - '-1'
      X-Ratelimit-Reset:
      - '1568836675'
    status:
      code: 201
      message: Created
version: 1
