tests/cassettes/test_xcover/test_delete_quotes.yaml

interactions:
- request:
    body: '{"request": [{"policy_type": "event_ticket_protection", "policy_type_version":
      1, "policy_start_date": "2021-10-02T02:35:43Z", "event_datetime": "2021-10-09T18:21:47Z",
      "event_name": "Ariana Grande", "event_location": "The O2", "number_of_tickets":
      2, "tickets": [{"price": 100}], "resale_ticket": false, "event_country": "GB"},
      {"policy_type": "event_ticket_protection", "policy_type_version": 1, "policy_start_date":
      "2021-10-02T04:16:12Z", "event_datetime": "2021-10-20T13:07:35Z", "event_name":
      "Ariana Grande", "event_location": "The O2", "number_of_tickets": 2, "tickets":
      [{"price": 100}], "resale_ticket": false, "event_country": "GB"}], "currency":
      "GBP", "customer_country": "GB", "customer_region": "London", "customer_language":
      "en"}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '746'
      Content-Type:
      - application/json
      User-Agent:
      - python-requests/2.26.0
      date:
      - Fri, 01 Oct 2021 12:24:35 GMT
    method: POST
    uri: https://staging.api.xcover.com/xcover/partners/LLODT/quotes/
  response:
    body:
      string: "{\"id\":\"8HGMX-3XNAP-INS\",\"status\":\"RECEIVED\",\"currency\":\"GBP\",\"total_price\":4.02,\"total_price_formatted\":\"\xA34.02\",\"partner_transaction_id\":null,\"created_at\":\"2021-10-01T22:24:36.111685Z\",\"updated_at\":\"2021-10-01T22:24:36.111705Z\",\"pds_url\":\"https://staging.xcover.com/en/pds/8HGMX-3XNAP-INS\",\"security_token\":\"EPVV7-FdOB2-V1EWN-lMRnB\",\"quotes\":{\"0\":{\"id\":\"5f09d2a2-5f9f-4f90-b2a7-02ee82dacfa7\",\"policy_start_date\":\"2021-10-02T02:35:43+00:00\",\"policy_end_date\":\"2021-10-09T18:21:47+00:00\",\"status\":\"RECEIVED\",\"price\":2.01,\"price_formatted\":\"\xA32.01\",\"policy\":{\"policy_type\":\"event_ticket_protection\",\"policy_type_group_name\":\"event\",\"policy_name\":\"Missed
        Event Cover (Generic)\",\"policy_code\":\"MECG0001\",\"policy_version\":\"5d24e2d1-a341-4b8b-9917-82878470a9c3\",\"category\":\"event_ticket_protection\",\"content\":{\"title\":\"Missed
        Event Cover for Ariana Grande\",\"header\":null,\"description\":\"90% of attendees
        add Missed Event Cover for generous protection when things go wrong or your
        plans change. For only  per ticket it covers you - and all ticket holders
        - if:\",\"optout_msg\":\"\",\"disclaimer\":\"<p>This insurance is arranged
        by Cover Genius Ltd which is authorised and regulated by the FCA (No.750711).
        Policies are underwritten by Markel International Insurance Company Limited
        which is authorised by the PRA and regulated by the FCA, (No.202570).</p>\"},\"underwriter\":{\"disclaimer\":\"This
        plan is arranged by XCover.com\",\"name\":\"Cover Genius Pty Ltd\"},\"claim_selector_id\":\"\"},\"insured\":null,\"tax\":{\"total_tax\":1.11,\"total_amount_without_tax\":0.9,\"total_tax_formatted\":\"\xA31.11\",\"total_amount_without_tax_formatted\":\"\xA30.90\",\"taxes\":[{\"tax_amount\":1.0,\"tax_code\":\"Admin.
        fee\",\"tax_amount_formatted\":\"\xA31.00\"},{\"tax_amount\":0.11,\"tax_code\":\"IPT\",\"tax_amount_formatted\":\"\xA30.11\"}]},\"duration\":\"7
        15:46:04\",\"benefits\":[{\"description\":\"Updated Transalation\",\"limit\":5.36,\"limit_policy_currency\":10.0,\"limit_formatted\":\"\xA35.36\",\"limit_policy_currency_formatted\":\"A$10.00\",\"excess\":2.68,\"excess_policy_currency\":5.0,\"excess_formatted\":\"\xA32.68\",\"excess_policy_currency_formatted\":\"A$5.00\"},{\"description\":\"Updated
        Transalation\",\"limit_description\":\"Benefit Text Test 01\",\"excess\":3.22,\"excess_policy_currency\":6.0,\"excess_formatted\":\"\xA33.22\",\"excess_policy_currency_formatted\":\"A$6.00\"},{\"description\":\"Description\",\"limit\":8.04,\"limit_policy_currency\":15.0,\"limit_formatted\":\"\xA38.04\",\"limit_policy_currency_formatted\":\"A$15.00\"},{\"description\":\"Description\",\"limit\":10.72,\"limit_policy_currency\":20.0,\"limit_formatted\":\"\xA310.72\",\"limit_policy_currency_formatted\":\"A$20.00\",\"excess_description\":\"Excess
        Text Test 01\"},{\"description\":\"Description\",\"limit_description\":\"Benefit
        Text Test 02\",\"excess_description\":\"Excess Text Test 02\"}],\"commission\":{\"partner_commission\":0.0,\"partner_commission_formatted\":\"\xA30.00\",\"surcharge_commission\":0.0,\"surcharge_commission_formatted\":\"\xA30.00\",\"total_commission\":0.0,\"total_commission_formatted\":\"\xA30.00\"},\"created_at\":\"2021-10-01T22:24:36.024417Z\",\"confirmed_at\":null,\"updated_at\":\"2021-10-01T22:24:36.024437Z\",\"cancelled_at\":null,\"is_renewable\":false,\"is_pricebeat_enabled\":null,\"cover_amount\":53.62,\"cover_amount_formatted\":\"\xA353.62\",\"pds_url\":\"https://staging.xcover.com/en/pds/8HGMX-3XNAP-INS?policy_type=event_ticket_protection_v1\",\"attachments\":[],\"files\":[],\"extra_fields\":{},\"surcharge\":{\"total_amount\":null,\"total_amount_formatted\":null,\"surcharges\":null},\"discount_price\":2.01,\"discount_price_formatted\":\"\xA32.01\",\"discount_amount\":0.0,\"discount_amount_formatted\":\"\xA30.00\",\"instalment_plans\":[]},\"1\":{\"id\":\"6463be6e-3a78-4bb7-8a3e-5b0ce8dfd9f7\",\"policy_start_date\":\"2021-10-02T04:16:12+00:00\",\"policy_end_date\":\"2021-10-20T13:07:35+00:00\",\"status\":\"RECEIVED\",\"price\":2.01,\"price_formatted\":\"\xA32.01\",\"policy\":{\"policy_type\":\"event_ticket_protection\",\"policy_type_group_name\":\"event\",\"policy_name\":\"Missed
        Event Cover (Generic)\",\"policy_code\":\"MECG0001\",\"policy_version\":\"5d24e2d1-a341-4b8b-9917-82878470a9c3\",\"category\":\"event_ticket_protection\",\"content\":{\"title\":\"Missed
        Event Cover for Ariana Grande\",\"header\":null,\"description\":\"90% of attendees
        add Missed Event Cover for generous protection when things go wrong or your
        plans change. For only  per ticket it covers you - and all ticket holders
        - if:\",\"optout_msg\":\"\",\"disclaimer\":\"<p>This insurance is arranged
        by Cover Genius Ltd which is authorised and regulated by the FCA (No.750711).
        Policies are underwritten by Markel International Insurance Company Limited
        which is authorised by the PRA and regulated by the FCA, (No.202570).</p>\"},\"underwriter\":{\"disclaimer\":\"This
        plan is arranged by XCover.com\",\"name\":\"Cover Genius Pty Ltd\"},\"claim_selector_id\":\"\"},\"insured\":null,\"tax\":{\"total_tax\":1.11,\"total_amount_without_tax\":0.9,\"total_tax_formatted\":\"\xA31.11\",\"total_amount_without_tax_formatted\":\"\xA30.90\",\"taxes\":[{\"tax_amount\":1.0,\"tax_code\":\"Admin.
        fee\",\"tax_amount_formatted\":\"\xA31.00\"},{\"tax_amount\":0.11,\"tax_code\":\"IPT\",\"tax_amount_formatted\":\"\xA30.11\"}]},\"duration\":\"18
        08:51:23\",\"benefits\":[{\"description\":\"Updated Transalation\",\"limit\":5.36,\"limit_policy_currency\":10.0,\"limit_formatted\":\"\xA35.36\",\"limit_policy_currency_formatted\":\"A$10.00\",\"excess\":2.68,\"excess_policy_currency\":5.0,\"excess_formatted\":\"\xA32.68\",\"excess_policy_currency_formatted\":\"A$5.00\"},{\"description\":\"Updated
        Transalation\",\"limit_description\":\"Benefit Text Test 01\",\"excess\":3.22,\"excess_policy_currency\":6.0,\"excess_formatted\":\"\xA33.22\",\"excess_policy_currency_formatted\":\"A$6.00\"},{\"description\":\"Description\",\"limit\":8.04,\"limit_policy_currency\":15.0,\"limit_formatted\":\"\xA38.04\",\"limit_policy_currency_formatted\":\"A$15.00\"},{\"description\":\"Description\",\"limit\":10.72,\"limit_policy_currency\":20.0,\"limit_formatted\":\"\xA310.72\",\"limit_policy_currency_formatted\":\"A$20.00\",\"excess_description\":\"Excess
        Text Test 01\"},{\"description\":\"Description\",\"limit_description\":\"Benefit
        Text Test 02\",\"excess_description\":\"Excess Text Test 02\"}],\"commission\":{\"partner_commission\":0.0,\"partner_commission_formatted\":\"\xA30.00\",\"surcharge_commission\":0.0,\"surcharge_commission_formatted\":\"\xA30.00\",\"total_commission\":0.0,\"total_commission_formatted\":\"\xA30.00\"},\"created_at\":\"2021-10-01T22:24:36.103210Z\",\"confirmed_at\":null,\"updated_at\":\"2021-10-01T22:24:36.103235Z\",\"cancelled_at\":null,\"is_renewable\":false,\"is_pricebeat_enabled\":null,\"cover_amount\":53.62,\"cover_amount_formatted\":\"\xA353.62\",\"pds_url\":\"https://staging.xcover.com/en/pds/8HGMX-3XNAP-INS?policy_type=event_ticket_protection_v1\",\"attachments\":[],\"files\":[],\"extra_fields\":{},\"surcharge\":{\"total_amount\":null,\"total_amount_formatted\":null,\"surcharges\":null},\"discount_price\":2.01,\"discount_price_formatted\":\"\xA32.01\",\"discount_amount\":0.0,\"discount_amount_formatted\":\"\xA30.00\",\"instalment_plans\":[]}},\"bundle_code\":null,\"bundle_price\":4.02,\"bundle_content\":{},\"bundle_price_formatted\":\"\xA34.02\",\"bundle_discount_percent\":0.0,\"bundle_discount_amount\":0.0,\"bundle_discount_amount_formatted\":\"\xA30.00\",\"errors\":{}}"
    headers:
      Allow:
      - GET, POST, DELETE, OPTIONS
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 69791a1efec4fd22-SYD
      Connection:
      - keep-alive
      Content-Length:
      - '6916'
      Content-Type:
      - application/json
      Date:
      - Fri, 01 Oct 2021 22:24:36 GMT
      Expect-CT:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Referrer-Policy:
      - same-origin
      Server:
      - cloudflare
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - DENY
      X-Ratelimit-Limit:
      - '-1'
      X-Ratelimit-Remaining:
      - '-1'
      X-Ratelimit-Reset:
      - '1568836675'
    status:
      code: 201
      message: Created
- request:
    body: '{"quotes": [{"id": "6463be6e-3a78-4bb7-8a3e-5b0ce8dfd9f7"}]}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '60'
      Content-Type:
      - application/json
      User-Agent:
      - python-requests/2.26.0
      date:
      - Fri, 01 Oct 2021 12:24:36 GMT
    method: POST
    uri: https://staging.api.xcover.com/xcover/partners/LLODT/quotes/8HGMX-3XNAP-INS/delete/
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAA6RW/W7bNhB/FYLYgBaTFIr+FroOSeZmAZos6Lys6FAItHSyicqkRlJJjMBPszfZ
        kw0nyR9y7NbD/jGsu9/xfndH3t0zlSmN6PCXq5uPfufj7fmdf337G/WodcKVlkb0w/hyfH0//pl6
        NCmNAZUsaUSvLu6oR512Io8LIxOgEQ9Y2BLFmTYL4Rygh3/+Rj31aCGMU2BiZ4SyInFSqxg5qDLP
        PZoYEA7SWDgaUc546IfMZ+GE84h3o04/CMOwP+x9oh4ti/Sb0AGroEVq49LkNKJz5wobnZ1ZJ2ZS
        zYKnRD+ACRK9OAN1VqT27EAqICmNdMvY6S+gaETHd/f3A/9d+usF9+/D8R+3fn7zQV1Qj/5VageW
        Rs+U4U+V217GRikX3O9lo8zvZiPmT7kY+IwDDHkqkkwMkKPOZbKMrRPGxRjZblR8wnjU6UXdzg+M
        RYxt8aDSF+jRJBxGPIy6gw36UDlbdftaxSpPGE/j0y0L9AcPoFzsZPIFXFwY7aCq5pYb4uKZ0WUR
        K7HYmGwBjfRGWgspGaOSXGJByKsrUGBk8noLTnRagceXV4ztEIsfwFj0G9FeyrvA09AXnW7od6fD
        qT8ahQN/yIeDYXfAxCjp4D0WDmbaLL8aQ6KVQ7LRM3XS5Ud4ZtqQcyOFEuTKCJUC9egcRApmfaNT
        sImRhasZjtj3RGcEc6xSAEtEmpIj584wBbq0ZMuLPM5BETeXambJTJNHo9WMaEOWujSkyIWyJJkL
        NYOAvNOGaJUvCSnAkDpEIh2pbrxFC+IToVIi8nytnus8RaVPZBZRj+rC6dLFCzujEaUeTaVNciEX
        GB59U7ydzKUlUtnSCJUAkZYIY9B9SqbLJpQrULK05L1LyeNcJvMKVbq5NhKjRgYGZmWOjxmt3BzI
        u8tz8upWB4MeG4Th64DcYakl5ssAKVUK5tFITCJa3AjzBXJyrRwYJTBPAr/WrC71ohBqSd7LhUQf
        h1g0fu8+nB8l5FWMOOO9AXsdvDkr3tKVRzdcMCXP7QRV2cGi7Cfm4+W661CPNo+glaw7t8SEoYPq
        uNhCDonTpmqVFOVV1mHTOJ14qq5q1X6rjzAIN/1YLHSpXPwo3RzrWelZMPK2+L2nj8b0uPUemgUj
        bDJOPGHz+/MZ/zVWyINVqvUDPk8XUgUkA6hN1sfvE2CMrrz2UawOaXvW9d3ka4cgnq4+rzyalkY0
        T3BAwl7U7UesSz06BQWZdDXr9lP9vZ4vZFINqlw0fSHHW0SjXtDpNx/xukFtxmPIMOZa2WaEZvSI
        XQt6/h0eglmFpwSsxT7dH66/XrrsocdGud/F+0N6zHDPZ2+d9dNTEbehF3VCyQSe8Mc6UrXqdRCd
        gPPjQfSPBoF2pwbRPxzEzztfmzIOA9Y9XsbesTKi2all7P0HOiELBvwoH370WlV2JxLirXu1V75x
        JWxX7yTu374G/HSfnK4+4wReLKStR/vzZm/clVb5eKl40QXqFag0yVyYGbw84pDq8CF1Q3xxwL74
        kPHqhO2W8W43HHyq149MmkUDrnv8NzdeNO/U5jj58rxlLm1sQMGjmOI2k4ncQiWsVr8pCBeDQt12
        GceRtGm+vU7Q523hfnNDxP9bt3/aWR1/PLKcxQ/YUYRzIpkvQFXN+7NHM5lD8xeenBFxJiFPcRlf
        7VR4OyTXcTXzc3fS7YRVazfmtpas6lWoArfW6Lb08D69wWzHGnshPXz9pLJO5Bh0XC17GO5q5dFp
        qdIcmqlYU25ELXYb2Hq1XbVxh/k2iG1oYBLY8N7XtoI6rDwcGxijTVWu1b8AAAD//wMAeGDnHJYO
        AAA=
    headers:
      Allow:
      - GET, POST, DELETE, OPTIONS
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 69791a257e4e6a3e-SYD
      Connection:
      - keep-alive
      Content-Encoding:
      - gzip
      Content-Type:
      - application/json
      Date:
      - Fri, 01 Oct 2021 22:24:37 GMT
      Expect-CT:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Referrer-Policy:
      - same-origin
      Server:
      - cloudflare
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      Transfer-Encoding:
      - chunked
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - DENY
      X-Ratelimit-Limit:
      - '-1'
      X-Ratelimit-Remaining:
      - '-1'
      X-Ratelimit-Reset:
      - '1568836675'
    status:
      code: 200
      message: OK
- request:
    body: 'null'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '4'
      Content-Type:
      - application/json
      User-Agent:
      - python-requests/2.26.0
      date:
      - Fri, 01 Oct 2021 12:24:37 GMT
    method: GET
    uri: https://staging.api.xcover.com/xcover/partners/LLODT/quotes/8HGMX-3XNAP-INS/
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAA4SS0U7bMBSGX8U60qRNS1rHTUniO2Cl2wUMMdSh3UTGPkkjgp3ZJ7CKx9mb7Mkm
        d4yCBuzGF/Zn//9/ft9BZ0BC+XF5fJHOLk72T9NPJ18ggUCKxgASzhaHi0+rxQdIQI/eo9UbkLA8
        OIUEyJHq68F3GkGKCc+ebNWN89eKCKPCr5/xHBIYlCeLviavbFCaOmfr6MGOfZ+A9qgITa0IJAgu
        sjTjKc/OhZAil7O9SZZle+X8GyQwDua/aMG36GBCPfoeJKyJhiCn00Cq7Ww7+aHdDfqJdtdTtNPB
        hOkzo0A9+o42NbkrtCBhcbpaFemR+Xwg0lW2+HqS9sdn9gAS+D46wgDyDnhctrOdN7wyQol03lRN
        mjcVTy+FKlIuEEthlG5UET26vtObOpDyVMdkj1OJcy7kbC7z2XvOJec7Hq35h67Os1KKTObFA/1c
        nU96e62xrVLMc69JmyHq4Q1aqqnTV0j14B3hts2dt8jVrXfjUFt1/XBlB9zvHnchoGGLeMgOYyHs
        7RIt+k6/28HamS28OFxy/shYfYM+RF0JcyNyFCZL1SzP0vyyvEyrKivSUpRFmRdcVXoW/7EibJ3f
        vJpBO0vRrLwD6qh/wWfjPNv3nbKKLb2yBiGBNSqD/u+PNhi07wb647Dib5hrWJyxNYiBKWPYC++2
        cQRuDGzni92u0TJad7YNrHXs1jvbMufZxo2eDb2ygem1si1O2JHzzNl+w9iAnsWIvwEAAP//jFVt
        a9swEP4rx7EPK7ienMZOakohy9godCOMDAZjGNVWajFbDpJMEkr++zj5pbVXj34Jke+ee3lO90hY
        kBbcjTeEgEvgKgNeFJ05r4qMjJcgdzF6WO1tVdukNI8YI3qYSZMWXJbUHt7sb7e5NCCVqTVXqQBp
        gGtN6TN4OLWtfBFK1gbubQaHXKa586ptXmlJXVMFWjzWBS0zoWwu4PN6Be+/Vf4iZIsguPBhQ6OW
        xJcWUKtM6IOWRCIhvnL9RxRwp6zQihNPnE5dVeuq3HN1gntZSsrxWhVt3s331WRBnqtoxmbhgl34
        Nx/2t3j2sK+FKHkaEuTYoaGMifm57lQHPWyXYEDWxp6IMErgwiVGFCK1lXZSifTdsS564bT86K6q
        k193CPyg12NeVrWyyUHanObp7My/9p79R6tPYJxGj7yZf00iY/mRxO/XE/1rUVQHc6ZugVdZKZUP
        OyEaSBd+XABjePaGoVjT0nOsu832f0HIH8+/zx5mtebtCi4gCON5FLM5evgglNhJ21Q9XNUfzfsC
        W/dQFbzVhYJuEcahfxW1h6QTqP55DBj13BiHFREMJ3AD19U7CkKsimMqjCGdjpbd6d+UIWVsjWMV
        j5Y4BRzlDDvW305FMnT92BAKW3GkH2PBSXXXxJU/m003EU02Qbi3NhG93sSnF6d+jEufzafHGE6N
        kWAvxvgXAAD//6RWwW7DIAz9l5yrKqXtepp22k9MqhBJnRWJMAloN6ni3ysDJZCQNdNu1bNNn2PL
        7/06xv0f6Gzq9YHM8iGza+XqFhIi2V6NxvfuwHx6i7g/XwOy/D9JZY+owH3PtZf2W/SNKeq+xzQw
        uQLeAl1Ue2bqE6ZPlELlR/xBnDwwhkvFdoG7rclutzl8ePvRcdWHZH/jnzpeLN/6clQ+IbJyrqkC
        Cd+sQTfTMaHBgc76NcAMBYmxwYyjJMXju9+uX0gOjo8bZvzPbr8l1vF1xpzRK14UZgxrzz1Id7yP
        q6rjAsJP+DGK0Y6DOKEZt8mEB5F89BX0M1W6pC0fjeXaI9ZbIZec2egcLfvpmDPIWj1By+vHpTZM
        YNPUmT1s19pV1VzkSUBQRU85QBm7mPawtjbPK/MNGUNroFqIvMfRrKlysNwbKPWl3LjsHQAA//8D
        AHhg5xyWDgAA
    headers:
      Allow:
      - GET, PATCH, DELETE, HEAD, OPTIONS
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 69791a293f7f16cd-SYD
      Connection:
      - keep-alive
      Content-Encoding:
      - gzip
      Content-Type:
      - application/json
      Date:
      - Fri, 01 Oct 2021 22:24:37 GMT
      Expect-CT:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Referrer-Policy:
      - same-origin
      Server:
      - cloudflare
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      Transfer-Encoding:
      - chunked
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - DENY
      X-Ratelimit-Limit:
      - '-1'
      X-Ratelimit-Remaining:
      - '-1'
      X-Ratelimit-Reset:
      - '1568836675'
    status:
      code: 200
      message: OK
version: 1
