tests/cassettes/test_xcover/test_get_instalments.yaml

interactions:
- request:
    body: '{"request": [{"policy_type": "event_ticket_protection", "policy_type_version":
      1, "policy_start_date": "2021-11-26T18:56:33Z", "event_datetime": "2021-11-27T06:54:13Z",
      "event_name": "Ariana Grande", "event_location": "The O2", "number_of_tickets":
      2, "tickets": [{"price": 100}], "resale_ticket": false, "event_country": "GB"}],
      "currency": "GBP", "customer_country": "GB", "customer_region": "London", "customer_language":
      "en"}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '430'
      Content-Type:
      - application/json
      User-Agent:
      - python-requests/2.26.0
      date:
      - Fri, 26 Nov 2021 01:54:06 GMT
    method: POST
    uri: https://api.xcover.com/xcover/partners/LLODT/quotes/
  response:
    body:
      string: "{\"id\":\"Y9PUH-8TQ3M-INS\",\"status\":\"RECEIVED\",\"currency\":\"GBP\",\"total_price\":2.01,\"total_price_formatted\":\"\xA32.01\",\"partner_transaction_id\":null,\"created_at\":\"2021-11-26T12:54:06.523968Z\",\"updated_at\":\"2021-11-26T12:54:06.523986Z\",\"pds_url\":\"https://staging.xcover.com/en/pds/Y9PUH-8TQ3M-INS\",\"security_token\":\"p0UW4-YpGyD-R2e8C-NEb3r\",\"quotes\":{\"0\":{\"id\":\"d6578e02-f939-4037-91d2-8be6711ed52b\",\"policy_start_date\":\"2021-11-26T18:56:33+00:00\",\"policy_end_date\":\"2021-11-27T06:54:13+00:00\",\"status\":\"RECEIVED\",\"price\":2.01,\"price_formatted\":\"\xA32.01\",\"policy\":{\"policy_type\":\"event_ticket_protection\",\"policy_type_group_name\":\"event\",\"policy_name\":\"Missed
        Event Cover (Generic)\",\"policy_code\":\"MECG0001\",\"policy_version\":\"5d24e2d1-a341-4b8b-9917-82878470a9c3\",\"category\":\"event_ticket_protection\",\"content\":{\"title\":\"Missed
        Event Cover for Ariana Grande\",\"header\":null,\"description\":\"90% of attendees
        add Missed Event Cover for generous protection when things go wrong or your
        plans change. For only  per ticket it covers you - and all ticket holders
        - if:\",\"optout_msg\":\"\",\"disclaimer\":\"<p>This insurance is arranged
        by Cover Genius Ltd which is authorised and regulated by the FCA (No.750711).
        Policies are underwritten by Markel International Insurance Company Limited
        which is authorised by the PRA and regulated by the FCA, (No.202570).</p>\"},\"underwriter\":{\"disclaimer\":\"This
        plan is arranged by XCover.com\",\"name\":\"Cover Genius Pty Ltd\"},\"claim_selector_id\":\"\"},\"insured\":null,\"tax\":{\"total_tax\":1.11,\"total_amount_without_tax\":0.9,\"total_tax_formatted\":\"\xA31.11\",\"total_amount_without_tax_formatted\":\"\xA30.90\",\"taxes\":[{\"tax_amount\":1.0,\"tax_code\":\"Admin.
        fee\",\"tax_amount_formatted\":\"\xA31.00\"},{\"tax_amount\":0.11,\"tax_code\":\"IPT\",\"tax_amount_formatted\":\"\xA30.11\"}]},\"duration\":\"11:57:40\",\"benefits\":[{\"description\":\"Test
        Benefit Description\",\"limit\":5.35,\"limit_policy_currency\":10.0,\"limit_formatted\":\"\xA35.35\",\"limit_policy_currency_formatted\":\"A$10.00\",\"excess\":2.68,\"excess_policy_currency\":5.0,\"excess_formatted\":\"\xA32.68\",\"excess_policy_currency_formatted\":\"A$5.00\"},{\"description\":\"Test
        Benefit Description\",\"limit_description\":\"Benefit Text Test 01\",\"excess\":3.21,\"excess_policy_currency\":6.0,\"excess_formatted\":\"\xA33.21\",\"excess_policy_currency_formatted\":\"A$6.00\"},{\"description\":\"Description\",\"limit\":8.03,\"limit_policy_currency\":15.0,\"limit_formatted\":\"\xA38.03\",\"limit_policy_currency_formatted\":\"A$15.00\"},{\"description\":\"Description\",\"limit\":10.71,\"limit_policy_currency\":20.0,\"limit_formatted\":\"\xA310.71\",\"limit_policy_currency_formatted\":\"A$20.00\",\"excess_description\":\"Excess
        Text Test 01\"},{\"description\":\"Description\",\"limit_description\":\"Benefit
        Text Test 02\",\"excess_description\":\"Excess Text Test 02\"}],\"commission\":{\"partner_commission\":0.0,\"partner_commission_formatted\":\"\xA30.00\",\"surcharge_commission\":0.0,\"surcharge_commission_formatted\":\"\xA30.00\",\"total_commission\":0.0,\"total_commission_formatted\":\"\xA30.00\"},\"created_at\":\"2021-11-26T12:54:06.513569Z\",\"confirmed_at\":null,\"updated_at\":\"2021-11-26T12:54:06.513593Z\",\"cancelled_at\":null,\"is_renewable\":false,\"is_pricebeat_enabled\":null,\"cover_amount\":53.54,\"cover_amount_formatted\":\"\xA353.54\",\"pds_url\":\"https://staging.xcover.com/en/pds/Y9PUH-8TQ3M-INS?policy_type=event_ticket_protection_v1\",\"attachments\":[],\"files\":[],\"extra_fields\":{},\"surcharge\":{\"total_amount\":null,\"total_amount_formatted\":null,\"surcharges\":null},\"discount_price\":2.01,\"discount_price_formatted\":\"\xA32.01\",\"discount_amount\":0.0,\"discount_amount_formatted\":\"\xA30.00\",\"instalment_plans\":[{\"name\":\"1year-monthly\",\"label\":\"1Year-Monthly\",\"amount\":2.01},{\"name\":\"1year-quarterly\",\"label\":\"1Year-Quarterly\",\"amount\":2.01}]}},\"bundle_code\":null,\"bundle_price\":2.01,\"bundle_content\":{},\"bundle_price_formatted\":\"\xA32.01\",\"bundle_discount_percent\":0.0,\"bundle_discount_amount\":0.0,\"bundle_discount_amount_formatted\":\"\xA30.00\",\"errors\":{}}"
    headers:
      Allow:
      - GET, POST, DELETE, OPTIONS
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 6b434370fcbb5545-SYD
      Connection:
      - keep-alive
      Content-Length:
      - '3869'
      Content-Type:
      - application/json
      Date:
      - Fri, 26 Nov 2021 12:54:06 GMT
      Expect-CT:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Referrer-Policy:
      - same-origin
      Server:
      - cloudflare
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - DENY
      X-Ratelimit-Limit:
      - '-1'
      X-Ratelimit-Remaining:
      - '-1'
      X-Ratelimit-Reset:
      - '1568836675'
    status:
      code: 201
      message: Created
- request:
    body: '{"quotes": [{"id": "d6578e02-f939-4037-91d2-8be6711ed52b", "instalment_plan":
      "1year-monthly"}], "policyholder": {"first_name": "Courtney", "last_name": "Dillon",
      "age": 30, "email": "courtney.dillon@test-xcover.com", "country": "GB", "region":
      null, "company": "Cooper LLC"}}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '276'
      Content-Type:
      - application/json
      User-Agent:
      - python-requests/2.26.0
      date:
      - Fri, 26 Nov 2021 01:54:06 GMT
    method: POST
    uri: https://api.xcover.com/xcover/partners/LLODT/bookings/Y9PUH-8TQ3M-INS/
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAA6RX/27jNhJ+FYK4Hro4SdFvy0K3vTTJ5hbYbNO9FNf2sBBocWyxK5EqSW1iBH6a
        vkmfrBhJtmPHTt27fwyLM8P55pvhcPhIBac5/Wl6+8O/3Ozu++jGffv+39ShxjLbGZrTi+/ev3n7
        4ebqkjq07LQGWS5pTq+/vaUOtcqyumi1KIHmoecHO0vFXOmGWQvo4vffUE4d2jJtJejCaiYNK61Q
        skAQsqtrh5YamAVeMEtzGvph4AaBG6Z3QZgnce6nXhJG0zT7mTq0a/lLqhMvmkRhlKJqy03R6Zrm
        tLK2NfnZmbFsIeTCeyjVZ9BeqZozkGctN2cHuICy08IuC6s+gaQ5bf0f/hO7P7XXy0v3QwjZhfv+
        ahZp6tBfO2XB0Py/jwOxPE0mGfihO59GUzf2o4k7DXjoZjNIJ0EAPAlniE/VolwWxjJtC4xqL6Is
        T9I8iv7h+7nvb/VB8mfakzs/xfiDrfbBXO4k7aV09a5o/rh2apctOoTPIG1hRfkJbNFqZaFP5RYc
        6hULrbq2kKzZmGwVxtUbYQxwcoVCcoHZIF9egwQtyldb5VLxXvnq4tr3nwArPoM26DenCQ9jCHng
        sigO3HiWzdzpNJi4WZhNsnjis2kZYREzCwully/GUCppEWz+SK2w9RGcc6XJuRZMMnKtmeRAHVoB
        46DX5czBlFq0dkA49b8gak6QY8kBDGGckyP7LpAC1RmyxUXuK5DEVkIuDFkocq+VXBClyVJ1mrQ1
        k4aUFZML8MgbpYmS9ZKQFjQZQiTCkr7cDVoQlzDJCavrtbhSNUehS8Q8pw5VrVWdLRqzoDmlDuXC
        lDUTDYZHv2q/vquEIUKaTjNZAhGGMK3RPSez5RjKNUjRGfLOcnJfibLqtTpbKS0wakSgYdHVeJLR
        ylZA3lycky/fK2+S+JMgeOWRW0y1QL40kE5y0PdaIIloccP0J6jJW2lBS4Y8Mfxao7pQTcvkkrwT
        jUAfh1CMfm8/nB8F5PSIQj9MJv4r76uz9mu6cugGC1LyuEtQzw4mZZ+YHy/WLYc6dDwEO2Td2iUS
        hg767QoDNZRW6b5PUlzvWYdN17TsoS/Vvvf2H4EXbJoxa1QnbXEvbIX57OW+N3W2+ntHH43pces9
        bd+bYpex7GHsfKgyWCEOvxetD/A5b4T0yBxgMFlvvw/A9+nK2d3KH0La7vX29u6lTVCfrj6uHMo7
        zcYjGAR5MsljBDwDCXNhB8y7B/UOjCXfDnJy+UTk0BrriOaJFyXjR7FuUZvbMfAx6kG4iwnN6BG7
        HdXzv+EmCBMeSjAGO3Warb+eu0zQ4yjc7+NpRo8Z7vlM1rz/NTqKXfW15h084I+xpG/Y60AiLwyO
        B5IeDQTtTg0kPRzIwVRmnh8dT2VyLJVodmoqk78AJ/C9SXAUT3i0tHq7EwGFO7W1l76rfnE3eydh
        //MyCE/3GdLVR7yHm0aY4YJ/3IyOT1d7Pp4LnvWCYRLqdFkxvYDnWxwSHd5kaIvPNthfPmS8OmXA
        DaIknf48DCFzoZsXR9wgTKbRadNwFCV+r1rixVjXo/JwgwhTaJBwz2Y47MxZbaBf7CfDGTBbgETZ
        dlDHG2vTm5PIS+Ldxf3Ohxr/3yj+zZPJ8vWR2a34jGeAWcvKqgHZd/ePDp2LGsa/8GA1K+YCam5o
        /rh6kvrtHbqOa7xen16ET8IapBtzM6ysHCrhwY581hvCmCxmUGzIp7nVHQxFLtDzKayUSjxjZfd5
        8vr446Tl8//Fgdfy+alOVg5lZdnzdEo4o+43gr+exVkUhnHqxhkDN2Zl6mY8Dd0y8zM2CeMwiZK/
        G7GQXTtiiC/j6s41tWlv3PgT+xFclf5y3WyeBsM4i8zOhTa22IxaHTaLJXVoIzivYRQMWarZVvNS
        1HXf3aBhAoMpR1OP95J/WjDW3UaEnislYXtEOmn18FrGosQCi3yHMs41GBOs9cbvcGMn7HL9v1XG
        DuPO8K1h0becsfSgVJIzvSxGiMPyTGhbjS/DNZR+Cu7DV/giePfuAiHVtbovhtZhxmO/co7NkX8y
        KLYaGtE1O7PluHZoYlz9AQAA//8DAOwlevJ8EAAA
    headers:
      Allow:
      - GET, POST, PATCH, HEAD, OPTIONS
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 6b4343758a6a55bd-SYD
      Connection:
      - keep-alive
      Content-Encoding:
      - gzip
      Content-Type:
      - application/json
      Date:
      - Fri, 26 Nov 2021 12:54:07 GMT
      Expect-CT:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Referrer-Policy:
      - same-origin
      Server:
      - cloudflare
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      Transfer-Encoding:
      - chunked
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - DENY
      X-Ratelimit-Limit:
      - '-1'
      X-Ratelimit-Remaining:
      - '-1'
      X-Ratelimit-Reset:
      - '1568836675'
    status:
      code: 200
      message: OK
- request:
    body: 'null'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '4'
      Content-Type:
      - application/json
      User-Agent:
      - python-requests/2.26.0
      date:
      - Fri, 26 Nov 2021 01:54:07 GMT
    method: GET
    uri: https://api.xcover.com/xcover/partners/LLODT/bookings/Y9PUH-8TQ3M-INS/instalments/
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAA+za227bRhAA0F8x9lkj7Mze+eY2bmC0CIzWLoIWgbDXWoAurkS2NgJ/Tf6kX1ZQ
        lm3aSVoC5VtXj7szy+HyDAVo9ZH93m3bvGfNrx/ZMrGGJa2MzZygOOFAcmHAYSKwIWuDmJOiwGZs
        k2/bxY2/W+dNy5pjrtGYtfYWvKMC0miEkJCDM5brIK2Smvrcbh3yjjU0e7j6+Kve5N1ymxb71u/a
        RfKHVOKEgASkL9E2Sjec//IcmjdpEEjAEUi9CNy3vu32rGFX7y5Oz9+wGYvb9Xq53y+3G9bwOZ+x
        dtv61cKvt11/s3yOZsZaf9vfd+tvj7vX+ttF3Kb+SqdpvdzMT0rO7BC4aO9u+vHvzt+fvVn8fPrD
        1dlxYuVDXn0p4w+/6voUnPMvfI5BjxUxPufuxdiibHdr37a5fyx/fTrM389eFHl+cXly9f3J6fuf
        XhZ5cfbjt2fvLk/fvq7x/OLydXE0tjr8l+qQ3X943OfDzjI+x8NCj0Of5Qymj6v+uWyvt137tAC3
        /xDxeQ2W3c/YvtvFa7/7rX+oH+9n7Eh8Ufxy1e360U23Wh0mlmnRbdrl6skgHgxSo2TDzVxoZZU9
        UDyusY/XOXWr/NxsyvVR2YGIuW8YT+AoaiiEVLBQyTIMGgYnbBh8bhghvtowD531lYap7VLbZWS7
        1C+IKv5/KV54GUTmBrhQAaTUDqw2HHwkIYMzNlg9EC+mEv8AeZx4quKr+MnE52Ql2iQga0MgVSjg
        TSyACQUGi8XHOBAvJxQ/+h0vqvgqfjrxnnueg4OSnQBJXoITkYOJVpdQsGQavuPVhOLFWPGyiq/i
        pxNPwUnlNQjyAmSOHALZACJnlD74gJYPxOsJxcux4lUVX8VPJt4FEckrBaF4AqmNAK9iBudI+0w+
        ej8UbyYUr8aK11V8FT+deE1OllKgoOEgiypguSHQWiO3VlESw99q7ITi9Vjxpoqv4icT700qRkUH
        gqwGmZMCl5MBjjL4EEzmGQfi3YTizVjxtoqv4icTzy2PqLMGkgpBShXAZRPBC2mkELog5eH5E5+Q
        vB1L3lXylfx0L/moSZE1EIqwIIWW4HWKwAUmnyWSMWJIHick70aSR17JV/LTnbrarEjnAkVwA5KH
        AE4TgkKufImoubVD8jQd+V7yOPL12LWS/+/kP7xauP+XzpOM4UTqNwrn1vQpsdvt8ibesYa9/eaC
        3f8NAAD//wMAu4RBSxYnAAA=
    headers:
      Allow:
      - GET, POST, HEAD, OPTIONS
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 6b434379ed15559f-SYD
      Connection:
      - keep-alive
      Content-Encoding:
      - gzip
      Content-Type:
      - application/json
      Date:
      - Fri, 26 Nov 2021 12:54:08 GMT
      Expect-CT:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Referrer-Policy:
      - same-origin
      Server:
      - cloudflare
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      Transfer-Encoding:
      - chunked
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - DENY
      X-Ratelimit-Limit:
      - '-1'
      X-Ratelimit-Remaining:
      - '-1'
      X-Ratelimit-Reset:
      - '1568836675'
    status:
      code: 200
      message: OK
- request:
    body: '{"quotes": [{"id": "d6578e02-f939-4037-91d2-8be6711ed52b", "payment_attempted_date":
      "2021-11-26T18:56:33Z", "payment_status": "PAID", "instalment_number": 1}]}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '160'
      Content-Type:
      - application/json
      User-Agent:
      - python-requests/2.26.0
      date:
      - Fri, 26 Nov 2021 01:54:08 GMT
    method: POST
    uri: https://api.xcover.com/xcover/partners/LLODT/bookings/Y9PUH-8TQ3M-INS/instalments/
  response:
    body:
      string: ''
    headers:
      Allow:
      - GET, POST, HEAD, OPTIONS
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 6b43437d1c1f6a24-SYD
      Connection:
      - keep-alive
      Date:
      - Fri, 26 Nov 2021 12:54:08 GMT
      Expect-CT:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Referrer-Policy:
      - same-origin
      Server:
      - cloudflare
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - DENY
      X-Ratelimit-Limit:
      - '-1'
      X-Ratelimit-Remaining:
      - '-1'
      X-Ratelimit-Reset:
      - '1568836675'
    status:
      code: 204
      message: No Content
version: 1
